app/Controllers/EventController.php

SELECT *
FROM `events`
---
    public function index()
    {
        $eventModel = new EventModel();
        $data['events'] = $eventModel->findAll();