app/Controllers/FetchController.php

SELECT `id`, `event_name`, `event_location`, `event_date`, `fullname`
FROM `registered_events`
---
    public function index()
    {
        // Get the database connection
        $db = \Config\Database::connect();

        // Create a query builder object for the 'registered_events' table
        $builder = $db->table('registered_events');

        // Select the columns you need
        $builder->select('id, event_name, event_location, event_date, fullname');

        // Execute the query
        $query = $builder->get();