app/Controllers/LoginAdmin.php

    public function auth()
    {
        helper(['form']);

        $session = session();
        $model = new AdminModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Validate input
        if (empty($username) || empty($password)) {
            return redirect()->back()->with('error', 'Username and password are required.');
        }

        // Check if username exists
        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'admin1'
 LIMIT 1