app/Controllers/UserController.php

    public function event()
    {
        try {
            // Instantiate the model
            $userModel = new UserModels();

            // Get all users
            $data['events'] = $userModel->findAll();
---
SELECT *
FROM `events`